### Variable types and printing in Python


This Python code defines three variables: a **float** (`counter = 100.00`), an **integer** (`miles = 100`), and a **string** (`name = "Mehvish"`).  
It then prints the values of all three variables using the **`print()` function**.  
The code demonstrates how different **data types** (**float**, **integer**, and **string**) are assigned and displayed in **Python**.

In [2]:
counter = 100.00  
miles = 100       
name = "Mehvish"

print(counter)
print(miles)
print(name)

100.0
100
Mehvish

### Using whole numbers in Python

The number `2` is a whole number (called an **integer**) in Python. It does not have a decimal point. We use whole numbers for counting and basic math in Python programs.

In [3]:
2

2

### Adding whole numbers in Python

The expression `2 + 3` adds two whole numbers. These are called **integers** in Python. The result is also a whole number. We use this to do basic math like addition in Python programs.

In [4]:
2+3

5

### Adding decimal numbers

The expression `2.3 + 5.5` adds two decimal numbers. Decimal numbers have a dot. In Python, they are called floats. We use them for things like money, weight, or length.

In [5]:
2.3+5.5

7.8

### Exponent in Python

`2**2` means 2 raised to the power of 2. It is called an **exponent** in Python. This gives the result `4`. We use this when we want to multiply a number by itself.

In [6]:
2**2

4

### Storing and printing strings

In this code, `'Mehvish'` and `"COMSATS"` are both strings. A string is a group of letters or text.  
We store them in variables `name` and `university`, then use `print()` to show both on the screen.

In [9]:
name = 'Mehvish'
university = "COMSATS"
print(name,university)

Mehvish COMSATS

### Accessing characters in a string

The string `'Hello World'` is saved in a variable.  
- `stringVariable[0]` gives the first letter: `H`  
- `stringVariable[1:5]` gives part of the string: `ello`

This shows how to get letters using index numbers.

In [10]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

### Changing part of a string

The string `"Hello World"` is saved in a variable.  
Then part of it is replaced using **slicing** and the **`+` operator**.  
- `stringVariable[:6]` gets **"Hello "**  
- **"Python"** is added after it

The final result is: **`Hello Python`**

In [12]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  Hello Python

### Deleting a string

A string is saved in a variable and printed.  
Then the variable is **deleted** using `del`.  
If we try to use it again, Python gives an **error** because it’s gone.

In [14]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

### • **String Special Operators**

### Joining two strings in Python

The string `"Hello"` is saved in a variable.  
Then `"Python"` is added to it using the **`+` operator** inside the `print()` function.

This joins both strings and prints: **HelloPython**

In [16]:
variable = "Hello"
print(variable+"Python")

HelloPython


### Repeating a string in Python

The string `"Hello"` is stored in a variable.  
Then `print(variable * 3)` repeats the string **three times**.

It prints: **HelloHelloHello**

In [18]:
variable = "Hello"
print(variable*3)

HelloHelloHello


### Using [ ] to get one letter from a string

We saved the word `"Hello"` in a variable.  
Then we used `[1]` to get the letter at **index 1**.

In Python, counting starts from 0:

- H = 0  
- e = 1  
- l = 2  
- l = 3  
- o = 4  

So `variable[1]` gives us: **e**

In [19]:
variable = "Hello"
print(variable[1])

e

### Using [:] to get part of a string

The string `"Hello"` is saved in a variable.  
`variable[1:3]` gives the letters from index 1 to 2 (3 is not included).  

So it prints: **el**

In [21]:
variable = "Hello"
print(variable[1:3])

el

### Using `in` to check a letter

This code checks if **'H'** is inside the word **"Hello"**.

It prints: **True**

In [23]:
variable = "Hello"
print('H' in variable)

True

### Using `not in` to check if a letter is missing

The string `"Hello"` is saved in a variable.  
This code checks if **'G'** is **not** in the string.

It prints: **True** (because 'G' is not in "Hello")

In [24]:
variable = "Hello"
print('G' not in variable)

True

### • **String Formatting Operator**

** "My name is %s and age is %d kg!"**
- `%s` is used to insert a **string** (like a name: "Zara")  
- `%d` is used to insert an **integer number** (like age: 21)

This line adds a name and number into the string using `%s` and `%d`.  
It prints: **My name is Zara and age is 21 kg!**

In [25]:
print ("My name is %s and age is %d kg!" % ("Zara",21))

My name is Zara and age is 21 kg!

### • **Creating and Showing a List**

**list1 = ['Mehvish', '1880']**

This line makes a list with two things: a name and a number (both as text).  
`print(list1)` shows the full list.

In [27]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

### Accessing Items in a List

**list1 = ['physics', 'chemistry', 1997, 2000]**  
**list2 = [1, 2, 3, 4, 5, 6, 7]**

- `list1[0]` shows the **first item** in list1 → **physics**
- `list2[1:5]` shows items from index 1 to 4 → **[2, 3, 4, 5]**

In [28]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

### Updating and Adding Items in a List

**list1 = ['physics', 'chemistry', 1997, 2000]**

- `list1[1] = "computer science"` changes the **2nd item** to `"computer science"`
- `list1.append('Computer Science')` adds a **new item** to the **end** of the list

In [29]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1)
list1.append('Computer Science')
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

### Deleting an Item from a List

**• list1 = ['physics', 'chemistry', 1997, 2000]**

- This list has 4 items.  
- `del list1[2]` means: remove the item at index **2** (which is **1997**).

In [30]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
del list1[2];
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

### Removing a Specific Value from a List

**• list1 = ['physics', 'chemistry', 1997, 2000]**

- This list has 4 items.  
- `list1.remove('chemistry')` deletes the **value `'chemistry'`** from the list (not by index, but by name).

In [31]:
 list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
list1.remove('chemistry')
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

### • **Dictionaries**

#### Showing a value from the dictionary using a key

**• dict = {'Name': "Mehvish", 'Depart': "BCS", 'Batch': 2014}**

- This is a **dictionary** that stores data using **key-value pairs**.
- `'Name'`, `'Depart'`, and `'Batch'` are the **keys**.
- `"Mehvish"`, `"BCS"`, and `2014` are the **values**.

`print(dict['Name'])` shows the value for the key `'Name'` → **Mehvish**

In [33]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Mehvish

#### Updating and Adding Values in a Dictionary

- A dictionary named `dict` is created with 3 key-value pairs:
  `'Name'`, `'Depart'`, and `'Batch'`.

- `dict['Batch'] = "SP14"`  
  -This **updates** the value of the key `'Batch'` from `2014` to `"SP14"`.

- `dict['University'] = "COMSATS"`  
  - This **adds** a new key `'University'` with the value `"COMSATS"`.

In [35]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict)
dict['University'] = "COMSATS"
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

#### Deleting a Key from a Dictionary

- A dictionary `dict` is created with keys: `'Name'`, `'Depart'`, and `'Batch'`.
- `del dict['Batch']` removes the key `'Batch'` and its value from the dictionary.

In [36]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
del dict['Batch']
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

#### Clearing All Items from a Dictionary

- A dictionary `dict` is created with keys: `'Name'`, `'Depart'`, and `'Batch'`.
- `dict.clear()` removes **all key-value pairs** from the dictionary.

In [37]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
dict.clear()
print (dict)

{}

### • **Tuples**

#### Getting values from a tuple

- A tuple is created with 4 items.
- `tup[1]` shows the second item → `'98'`
- `tup[1:3]` shows a slice → `('98', 'C programming')`

In [38]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

#### Joining two tuples to make a new one

We made two tuples:

- `tup1 = (12, 34.56)` → has a number and a decimal  
- `tup2 = ('abc', 'xyz')` → has two text values

Tuples **can’t be changed**.  
So we **can’t write** `tup1[0] = 100` (this gives an error)

Instead, we **join** both using `+` like this:  
`tup3 = tup1 + tup2`

In [2]:
 tup1 = (12, 34.56);
 tup2 = ('abc', 'xyz');
tup3 = tup1 + tup2; 
print (tup3);

(12, 34.56, 'abc', 'xyz')

#### Deleting the whole tuple

- A tuple `tup` is made with 4 items.
- `del tup` removes the **entire tuple** from memory.
- After that, if we try to print it, Python gives an **error** because `tup` no longer exists.

In [2]:
tup = ('physics', 'chemistry', 1997, 2000)
print(tup)

del tup
print("After deleting tup:")

print(tup)

('physics', 'chemistry', 1997, 2000)
After deleting tup:

NameError: name 'tup' is not defined

###   Convert List to Set
- Convert a list to a set  
- Create sets with different data types  
- Add single and multiple values  
- Remove values using `discard()` and `remove()`  
- Understand how sets work in Python

In [4]:
list1 = [1,2,3,4,5] 
print (type(list1)) 
my_set = set(list1) 
print(my_set) 
(type(my_set))  
my_set = {1,2,3} 
print (my_set) 
print 
my_set = {1,"Hello", 1.2,'C'} 
my_set.add('D') 
my_set.update(list1) 
print (my_set) 
my_set.discard('G')  
my_set.remove('G')

<class 'list'>
{1, 2, 3, 4, 5}
{1, 2, 3}
{1, 1.2, 2, 3, 4, 5, 'Hello', 'D', 'C'}

KeyError: 'G'

### • **Comparison Operator in Python**
###  Checking If One Number Is Less Than Another

- This checks if **1 is less than 3**.
- Since 1 is smaller than 3, the result is:

In [5]:
1<3

True

###  Checking If a Number Is Less Than or Equal To Another

- This checks if **15 is less than or equal to 23**.
- Since 15 **is** less than 23, the result will be **true**

In [6]:
15 <= 23

True

### Checking If Two Strings Are Equal
- This compares two strings: `'Mehvish'` and `"Zeenat"`
- It checks if **both strings are exactly the same**
- Since the strings are **different**, the result will be **False**

In [7]:
'Alina' == "Alina

False

### Checking If Two Strings Are Not Equal

- This checks if the two strings are **not equal**
- Since both strings are **exactly the same**, the result will be **False**

In [8]:
 "Alina" != "Alina"

False

### Using the OR Logical Operator
- This code uses the **`or`** logical operator.
- It checks if **at least one condition is True**.
Breakdown:
- `(1 == 1)` → `True`  
- `(5 > 2)` → `True`

Since **both are True**, and `or` needs **only one True**

In [9]:
(1==1)or(5>2)

True

### Using the AND Logical Operator
- This code uses the **`and`** logical operator.
- `and` only returns `True` if **both conditions** are `True`.

Breakdown:
- `(1 < 2)` → `True`  
- `(2 < 1)` → `False`

Since **one condition is False**

In [10]:
(1<2)and(2<1)

False

### • **If-Else Statements**
### Even or Odd Check Using % Operator

- `%` finds the **remainder** after division.
- == is a comparison operator used to check if two values are equal.
- If `number % 2 == 0`, the number is **Even**.
- Else, it's **Odd**.

In [11]:
if 25 % 2 == 0:
    print('Even')
else:
    print('Odd')

Odd

### Factorial Using a For Loop in Python

This code calculates the **factorial** of a number using a `for` loop.

- `fact = 1` → initial value
- `N = 5` → we want factorial of 5
- `range(1, N+1)` → loop runs from 1 to 5
- In each loop: `fact *= i` means `fact = fact * i`

So, it calculates:

`1 × 2 × 3 × 4 × 5 = 120`

In [13]:
fact = 1
N = 5
for i in range(1, 1+N): 
    fact *= i 
print(fact)

120

### Counting Using a While Loop 
This Python code uses a `while` loop to **print numbers from 1 to 10**.

- It starts with `a = 0`
- The loop runs **while `a` is less than 10**
- Each time, it **adds 1 to `a`** and prints it
- Final output shows numbers from **1 to 10**

In [14]:
a = 0
while a < 10:
    a = a + 1
    print(a)

1
2
3
4
5
6
7
8
9
10

### • **Functions**
###  Printing a Message Using a Function
This code defines a function that takes a message (string) and prints it.

- A function named `printme` is created using `def`
- It takes one input (a string)
- When the function is called, it prints that string

In [18]:
def printme(str):

    print(str)
    return
printme("I'm first call to user defined function!")

I'm first call to user defined function!

###  Returns the square of a number

- A function is created that takes one number (`x`)
- It returns `x` multiplied by itself (x²)
- When `f(8)` is called, it calculates `8 × 8 = 64`

In [19]:
def f(x):
    return x**2

print(f(8))

64

### Multiplies a number by 3 using a lambda function

lambda is a shortcut way to write a small function in just one line.
- It takes a number and returns that number × 3
- When `10` is given, it returns `30`

In [22]:
times3 = lambda var:var*3 
times3(10)

30

###  Length of each word in a sentence

- The sentence is split into words  
- Then a lambda function with `map()` is used to count each word's length  
- The result is a list of word lengths

In [23]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print(words)

lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

### • **Filter()** 
###  Filters and returns only odd numbers from a list

- A list of Fibonacci numbers is given
- `filter()` is used with a `lambda` function
- The lambda checks: `x % 2` (means: number is odd)
- It keeps only the **odd numbers** in the list

In [28]:
fib = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
result1 = filter(lambda x: x % 2, fib)
print(list(result1))

[1, 1, 3, 5, 13, 21, 55]

###  Filters and returns only even numbers from a list

- A list of Fibonacci numbers is given  
- A **filter** with `lambda` is used to check if a number is even (`x % 2 == 0`)  
- It returns a list of only the even numbers

In [29]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result2 = filter(lambda x: x % 2 == 0, fib) 
list (result2)

[0, 2, 8, 34]

### • **File I/O**
### Taking Input from the User


This code takes user input and prints it.

- The `input()` function asks the user to **enter their name**
- Whatever the user types is saved in the variable `string`
- `print(string)` shows that name on the screen

In [31]:
name = input("Enter your name: ")
print(name)

Enter your name:  Alina

Alina

 ### Creating and Writing to a Text File 
This code **creates** a file named **file.txt**, **writes** two lines into it (**Name** and **Department**), then **reads** and **prints** the content using **Python**.

In [12]:
fileOpen = open("file.txt", "w")
fileOpen.write("Name: Mehvish Ashiq\nDepartment: BSCS")
fileOpen.close()

In [10]:
import os
print(os.listdir())

['.ipynb_checkpoints', 'Assignment 1.ipynb', 'file.txt']

### Reading from a File in Python
This code opens a file, reads its content, and then closes it.

- `open("file.txt", "r+")` opens the file in **read and write mode**
- `read()` reads the entire content of the file  
  (you can use `read(12)` to read only the first 12 characters)
- `print(str)` displays the content
- `close()` closes the file after reading

In [11]:
fileOpen = open("file.txt", "r+")
str = fileOpen.read()
print(str)
fileOpen.close()

Name: Mehvish Ashiq
Department: BSCS

### Appending and Reading from a File

This code **opens** a file named **file.txt** in **append mode** to **add new text** ("Information Technology Lahore") at the end of the file.  
Then it **reopens** the same file in **read mode** and **prints all the content** from the start.  
It uses **a+** to write at the end and **r+** to read from the beginning.  
Finally, it **closes** the file after both operations.

In [14]:
fileOpen = open("file.txt", "a+")
fileOpen.write(" Information Technology Lahore")
fileOpen.close()

fileOpen = open("file.txt", "r+")
string = fileOpen.read() 
print(string)

fileOpen.close()

Name: Mehvish Ashiq
Department: BSCS Information Technology Lahore

### Reading and Seeking in a File

This code works with a file using different file handling functions:

- `open("file.txt", "r+")`: Opens the file for reading and writing
- `read(10)`: Reads the first 10 characters from the file
- `tell()`: Tells the current position of the pointer
- `seek(0, 0)`: Moves the pointer back to the beginning of the file
- The file is then read again and finally closed

It helps us understand how to control **where** to read in a file using `seek()` and `tell()`.

In [45]:

fo = open("file.txt", "r+")
str = fo.read(10)
print("Read String is:\n", str)
position = fo.tell()
print("Current file position:\n", position)
fo.seek(0, 0)

str = fo.read(10)
print("Again read String is:\n", str)
fo.close()

Read String is:
 Name: Mehv
Current file position:
 10
Again read String is:
 Name: Mehv

##  Removing a File in Python
os.remove("newfile.txt")
→ This command deletes the file named newfile.txt from the current working directory.
→ If the file does not exist, Python will raise a FileNotFoundError.

In [71]:
#remove file 
os.remove("newfile.txt")

## • **Pandas Introduction**
### **Imports**
• `import pandas as pd` → Imports the **Pandas** library with the alias **pd**, used for **data analysis** and **manipulation**.

• `import numpy as np` → Imports the **NumPy** library with the alias **np**, useful for **numerical operations** like generating **random numbers**.

• `import matplotlib.pyplot as plt` → Imports **Matplotlib’s** plotting module, used for creating **graphs/plots** (optional here).

• `np.random.randn(5)` → Generates **5 random numbers** from a **standard normal distribution** (mean = 0, std = 1).

• `pd.Series(...)` → Creates a **Pandas Series**, which is like a **one-dimensional labeled array**.

• `index=['a', 'b', 'c', 'd', 'e']` → Assigns **custom index labels** from `'a'` to `'e'` to each element of the **Series**.

In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print("Generated Series:")
print(s)

Generated Series:
a   -0.546771
b    0.448762
c   -0.557022
d   -1.531334
e   -1.147446
dtype: float64

## Easy Explanation of `s.index`

• `s.index` shows the **labels** (like a, b, c...) that are used to identify each value in the Series.

• These labels are called the **index**.

• It also tells you what **type of data** the labels are (like text or numbers).

• `print(s.index)` will display those labels on the screen.

• Helpful when you want to **see or check** the positions (index) of your data.

In [75]:

s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

## Easy Explanation of `pd.Series(np.random.randn(5))`

• This creates a **Pandas Series** with **5 random values**.

• We did **not give any index**, so Python will **automatically add numbers** as index: `0, 1, 2, 3, 4`.

• These numbers are called the **default index**.

• The values in the Series are created using `np.random.randn(5)`, which gives **5 random numbers** from a normal distribution.

• This is useful when you only care about the values, not the labels.

In [78]:
pd.Series(np.random.randn(5))

0    0.502244
1   -0.519058
2    2.171957
3   -0.339530
4    0.520845
dtype: float64

##   Creating a Series from a Dictionary

• `d = {'a': 0., 'b': 1., 'c': 2.}` → This is a simple **Python dictionary** with keys (`a`, `b`, `c`) and values (`0.0`, `1.0`, `2.0`).

• `pd.Series(d)` → This creates a **Pandas Series** from the dictionary.

• The **keys** of the dictionary become the **index** of the Series.

• The **values** of the dictionary become the **data** of the Series.

• This is a quick way to turn structured data into a labeled Series.

In [81]:
import pandas as pd
d = {'a': 0., 'b': 1., 'c': 2.}  
s = pd.Series(d)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

#  Creating a Pandas Series from a Dictionary (with Custom Index)

We first make a **dictionary** with some key-value pairs:

d = {'a': 0., 'b': 1., 'c': 2.}

Now we create a **Series** using this dictionary and give our own **index**:
pd.Series(d, index=['b', 'c', 'd', 'a'])
 The keys **'b'**, **'c'**, and **'a'** are found in the dictionary, so their values are shown.
 The key **'d'** is not found, so Pandas puts **NaN** (missing value) for it.
 The values appear in the same order as the **custom index** we gave.

In [83]:

pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

# Creating a Pandas Series with a Scalar Value

In the following example, a **single value (scalar)** is given as data:

pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

• Since the value is a **scalar (5.0)** and the **index has 5 labels**,  
  Pandas will **repeat the value** to match the length of the **index**.

• The result is that every index label gets the same value (5.0).

In [87]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

#  Accessing a Single Value from Series (Like ndarray)
 **s[0]** accesses the first value in the Series using its position.
Even though the Series has custom labels (like 'a', 'b', etc.), you can still access values by position numbers — just like an array.
 This is similar to how we access items in a NumPy array or Python list.

In [95]:
print(s.iloc[0])

-0.4099336125957855

#  Accessing a Range of Values in a Series (Slicing)
 This returns the **first 5 elements** in the Series.
 s[:5] uses **slicing** — just like Python lists or NumPy arrays.
 Even though the Series has custom index labels, slicing works based on **position** here.
 This is useful when you want to select a portion of the Series.

In [97]:

print(s[:5])

a   -0.142493
b    1.277842
c    1.084928
d    0.728022
e   -1.161700
dtype: float64

#  Values Greater than Median
**s.median()** returns the middle value (median) from the Series.
s > s.median() checks which values are greater than the median → gives a True/False mask.
 s[...] applies that mask and returns only values where the condition is True. This is called boolean indexing or filtering.

In [98]:

print(s[s > s.median()])

b    1.277842
c    1.084928
dtype: float64

# Accessing Specific Indexes in a Series

This code returns **specific values** from a **Series** using index positions `4`, `3`, and `1`.  
For example, if the Series is `['a', 'b', 'c', 'd', 'e']`, it will return the values **e**, **d**, and **b**.

In [28]:
print(s[[4, 3, 1]])

4    e
3    d
1    b
dtype: object

#  Applying Exponential Function in Python using `np.exp(s)`

The function `np.exp(s)` applies the **exponential function** to every element of the Series `s`.

This means:  
It calculates **e^x** (Euler’s number raised to the power x) for each value in the Series.  
Where **e ≈ 2.718** (a mathematical constant).

In [35]:

print(np.exp(s))

a    0.663650
b    0.826959
c    0.360595
d    2.585710
e    0.453845
dtype: float64

#  Accessing a Value by Index Label in a Pandas Series

The expression `s['a']` retrieves the **value associated with index label `'a'`** in the Pandas Series `s`.

print(s['a'])

#  Updating a Value in a Series Using Index Label

This code **updates** the value at index `'e'` in a Pandas Series.

In [39]:

s['e'] = 12.0
print(s)

a    -0.409934
b    -0.188738
c    -1.018550
d     0.950447
e    12.000000
dtype: float64

#  Checking if an Index Label Exists in a Series

The expression `'e' in s` checks if `'e'` is present in the **index labels** of the Series `s`.

In [42]:
print('e' in s)

True

#  Accessing Missing Labels in a Pandas Series

###  Direct Access (`s['f']`):
If you try to access a label that **does not exist** in the Series using `s['f']`,  
Python will raise a **KeyError**.
The method `s.get('f', np.nan)` tries to **access the value at index `'f'`**.  
If the label `'f'` **does not exist**, it **does not raise an error** — instead, it returns the **default value**: `np.nan`.

In [44]:

print(s.get('f'))          
print(s.get('f', np.nan))

None
nan

##  Adding Two Series by Index

- S and s are pandas Series with the *same index labels* ('a' to 'e').
- When doing **S + s**, pandas adds values with *matching index labels*.
- No loops needed — it's a *vectorized operation*.
- Output is a new Series with the same indexes and summed values.

### Key Point:
pandas matches **labels** (not positions) when doing operations like addition.

In [46]:
result = S + s
print(result)

a    -0.819867
b    -0.377477
c    -2.037099
d     1.900894
e    24.000000
dtype: float64

#  Multiplying Each Value in a Series: `s * 2`
The expression `s * 2` multiplies **each element** of the Series `s` by `2`.  
This is an example of a **vectorized operation** in Pandas.

In [48]:
result = s * 2
print(result)

a    -0.819867
b    -0.377476
c    -2.037099
d     1.900894
e    24.000000
dtype: float64

# Creating a Random Series with a Custom Name
The code creates a Pandas Series with:
- **5 random numbers** from a standard normal distribution (mean = 0, std = 1)
- An optional **name** assigned to the Series → `'something'`

In [49]:
s = pd.Series(np.random.randn(5), name='something')
print(s)

0    0.295371
1   -0.183793
2   -1.152553
3   -0.141074
4    1.319445
Name: something, dtype: float64

#  Getting the Name of a  Series using `s.name`

The code `s.name` returns the **name** given to the Series.

In [50]:
 s.name

'something'

# Renaming the Name of a Series
This line changes the name of the Series **s** and stores it in a new Series called **s2**.

The original Series s remains unchanged.

Only the name of ***s2** is updated.

In [52]:
 
s2 = s.rename("different") 
s2.name

'different'

## Creating a DataFrame from a Dictionary of Series

- **`import pandas as pd`** → Imports the **Pandas library** for data handling.

- A **dictionary `d`** is created with two **Series**:
  - **'one'** → values `[1.0, 2.0, 3.0]`, index `['a', 'b', 'c']`
  - **'two'** → values `[1.0, 2.0, 3.0, 4.0]`, index `['a', 'b', 'c', 'd']`

- **`pd.DataFrame(d)`** → Converts the dictionary into a **DataFrame**:
  - **Column names** come from the dictionary keys: `'one'`, `'two'`
  - **Row labels** are taken from the **combined indexes**

- **`print(df)`** → Displays the final **table** with rows and columns.  
  If any value is **missing**, **`NaN`** is shown.

In [55]:
d = {
    'one': pd.Series([1.0, 2.0, 3.0], index=['a', 'b', 'c']),
    'two': pd.Series([1.0, 2.0, 3.0, 4.0], index=['a', 'b', 'c', 'd'])
}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

### 📘 Constructing a DataFrame with Custom Row Labels
- This creates a **DataFrame** from the dictionary `d`.
- It only includes the **rows labeled** `'d'`, `'b'`, and `'a'`, in that specific order.
- If data is **missing for a label** (like `'d'` in column `'one'`), it shows **`NaN` (Not a Number)**.

In [4]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

##  Creating a DataFrame with Specific Rows and Columns
- This line creates a **DataFrame** using the dictionary `d`.
- It selects only the **rows** labeled `'d'`, `'b'`, and `'a'`.
- It includes only the **columns** `'two'` and `'three'`.
- Column `'three'` does **not exist** in the original data, so all its values will be **NaN**.

In [7]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

## Viewing Column Names in a DataFrame 
- `df.columns` returns the **column labels** of the DataFrame `df`.
- It shows all the column names as an **Index object**.
- Useful when you want to check which columns are available in the DataFrame.

In [8]:
 df.columns

Index(['one', 'two'], dtype='object')

## Creating a DataFrame from a Dictionary of Equal-Length ndarrays
- A dictionary `d` is created with two keys: `'one'` and `'two'`, each containing a list of 4 float values.
- Since all lists (ndarrays) are of the **same length**, a DataFrame can be created without issues.
- No **row labels (index)** are provided, so pandas will use the default: `0, 1, 2, 3`.
- Column labels will be taken from the dictionary keys.

In [10]:
d = { 
    'one': [1., 2., 3., 4.],
    'two': [4., 3., 2., 1.]
}

pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

## Creating a DataFrame with Custom Row Labels (Index)
- A dictionary `d` has two keys (`'one'` and `'two'`) with lists of 4 float values each.
- Custom **row labels (index)** are given: `'a'`, `'b'`, `'c'`, `'d'`.
- The number of row labels **must match** the number of elements in each array.
- Column labels are automatically taken from the dictionary keys.

In [13]:
df = pd.DataFrame(d, index=['a', 'b', 'c', 'd'])
print(df)

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

##  Constructing a DataFrame from a List of Dictionaries
- The list `data2` contains two dictionaries.
- Each dictionary represents a **row**.
- Keys in the dictionaries become **column names**.
- If a column (like `'c'`) is missing in any row, it shows **NaN** (missing value).

In [14]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data2)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

##  Passing List of Dicts as Data with Custom Row Labels

 - The list **`data2`** contains two dictionaries.
 - Each dictionary becomes a row in the DataFrame.
 - Keys in the dictionaries become the column names.
 - **`index=['first', 'second']`** sets custom row labels.
 - If a key is missing in any row (like 'c' in the first), it will show NaN.

In [15]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data2, index=['first', 'second'])
print(df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

##  Passing List of Dicts as Data and Specifying Column Labels
- `data2` is a list of dictionaries; each dict becomes a row.
- We specify columns manually using **`columns=['a', 'b']`**.
- Only the specified columns will appear in the DataFrame.
- Column `**c'** is ignored because it is not listed.

In [16]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data2, columns=['a', 'b'])
print(df)

   a   b
0  1   2
1  5  10

##  DataFrame with Tuples as Row and Column Labels


 - Tuple keys in the outer dict become column labels (MultiIndex).
 - Tuple keys in the inner dict become row labels (MultiIndex).
 - Missing values are shown as NaN.

In [18]:

df = pd.DataFrame({
    ('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
    ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
    ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
    ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
    ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}
})

print(df)

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## Structured NumPy Array with Named Fields

 - This creates an array with **2 rows (elements)**.
- Each row has **3 fields**:
    • **'A'** → **32-bit integer** (`i4`)  
    • **'B'** → **32-bit float** (`f4`)  
    • **'C'** → **string** of up to **10 ASCII characters** (`a10`)
- All values are initialized to **zero or empty**.
- The output shows two records like **(0, 0.0, b'')**, meaning:
    • **Integer** `0`  
    • **Float** `0.0`  
    • **Empty byte string** (`b''`)

In [20]:
data = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])
print(data)

[(0, 0., b'') (0, 0., b'')]

C:\Users\HS TRADER\AppData\Local\Temp\ipykernel_10372\2198409554.py:1: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])

## Convert Structured NumPy Array to DataFrame (with Index Column)


 - Creates a **structured NumPy array** with fields: **'A'**, **'B'**, **'C'**
- **'A'** → **32-bit integer** (`i4`)
 - **'B'** → **32-bit float** (`f4`)
 - **'C'** → **fixed-length ASCII string** (`a10`)
 - Uses **from_records()** to convert array to a **DataFrame**

In [21]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

## Creating DataFrame Using `from_items()` Method


 - The method **from_items()** was used to create a **DataFrame** from a list of **(key, value)** pairs.
- Each **key** becomes a **column name** (`'A'`, `'B'`).
 - Each **value list** becomes the **column data**.
 - The row labels (index) are automatically set to **0, 1, 2**.

In [23]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

##  DataFrame from Row-Wise Values with Custom Column Names

- Creates a DataFrame from **(key, list)** pairs.
 - `orient='index'` makes **keys as row labels** (index).
 - Each list becomes a **row**.
 - `columns=['one', 'two', 'three']` sets **custom column names**.
 -  `from_items()` is **removed** in latest pandas versions.
   Use `from_dict(..., orient='index')` instead.

In [26]:
df = pd.DataFrame.from_dict(
    {'A': [1, 2, 3], 'B': [4, 5, 6]},
    orient='index',
    columns=['one', 'two', 'three']
)

print(df)

   one  two  three
A    1    2      3
B    4    5      6

## Accessing a Single Column from a DataFrame

 - `df['one']` returns the **column named 'one'** from the DataFrame.
 - The result is a **Series** containing all values under that column.
 - The **index** remains the same (in this case: 'A' and 'B').

In [31]:

print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

#  Adding New Columns in DataFrame

- **`df['three'] = df['one'] * df['two']`**  
   Adds a new column called **three** by multiplying columns **'one'** and **'two'**

- **`df['flag'] = df['one'] > 2`**  
   Adds a column called **flag**  
   Puts **True** if value in **'one' > 2**,

In [32]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2
print(df)

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

#  Deleting Columns from a DataFrame

- **`del df['two']`**  
   **Deletes** the column named **'two'** permanently from the DataFrame.

- **`three = df.pop('three')`**  
   **Removes** the column **'three'** from DataFrame  
   And **stores** it separately in the variable **`three`**

- **`df`**  
   Shows the updated DataFrame after columns are removed.

In [38]:
if 'two' in df.columns:
    del df['two'] 

if 'three' in df.columns:
    three = df.pop('three')

df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

#  Adding a Column with a Default Value

- **`df['foo'] = 'bar'`**  
  Adds a new column called **'foo'** to the DataFrame  
   Fills **each row** in that column with the value **'bar'**

- **`df`**  
   Shows the **updated DataFrame**

In [39]:
df['foo'] = 'bar'   # Adds a new column named 'foo' with value 'bar' in every row
df                  # Show the updated DataFrame

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

#  Creating a Partial Copy of a Column

- **`df['one'][:2]`**  
   This selects only the **first 2 values** from the column **'one'**

- **`df['one_trunc'] = ...`**  
  Creates a new column called **'one_trunc'** and fills it with the **partial data** from `'one'`

- **`df`**  
  Shows the updated DataFrame with the new column

Rows not in the first 2 will show **NaN** in `'one_trunc'`

In [40]:
df['one_trunc'] = df['one'][:2]  
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

# Inserting a Column at a Specific Position in a DataFrame


• **First argument**: index where new column will be inserted.  
• **Second argument**: label or title of a new column.  
• **Third argument**: it will create a column at specified position.

In [44]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'one': [1.0, 2.0, 3.0, np.nan],
    'flag': [False, False, True, False],
    'foo': ['bar', 'bar', 'bar', 'bar'],
    'one_trunc': [1.0, 2.0, np.nan, np.nan]
}, index=['a', 'b', 'c', 'd'])

df.insert(1, 'bar2', df['one'])
print(df)

   one  bar2   flag  foo  one_trunc
a  1.0   1.0  False  bar        1.0
b  2.0   2.0  False  bar        2.0
c  3.0   3.0   True  bar        NaN
d  NaN   NaN  False  bar        NaN

##  Accessing a Specific Row using `loc[]`
 Returns all **column labels** and their **values** for row with **label 'b'**.
Output is a **Series** representing that one row

In [4]:

print(df.loc['b'])

one            2.0
bar2           2.0
flag         False
foo            bar
one_trunc      2.0
Name: b, dtype: object

# Accessing a Row by Position

- **`df.iloc[2]`**  
  Returns the **third row** (since Python indexing starts from **0**)  
  Output is a **Series** showing all **column names** and their **values** for that row

In [7]:
df.iloc[2]

one           3.0
bar2          3.0
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

# Adding Two DataFrames with Matching Column Labels

- **`df`**  
  A DataFrame of shape **(10, 4)** with columns **['A', 'B', 'C', 'D']**

- **`df2`**  
  A smaller DataFrame of shape **(7, 3)** with columns **['A', 'B', 'C']**

- **`df + df2`**  
  Adds the values of **matching column labels** and **matching row indices**

- **Missing rows or columns**  
  If a label doesn't exist in either DataFrame (like column `'D'` in `df2`), the result will show **NaN** for those positions

- **Shape of result**  
  The final DataFrame will have the **same shape as the larger DataFrame (`df`)**, but values will only be added where labels **and indices match**

In [17]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

df + df2

          A         B         C   D
0 -2.300408  0.383741  0.504073 NaN
1  0.382949  0.967817  2.178833 NaN
2  0.946209 -0.574069 -0.306703 NaN
3 -1.430467 -1.384627 -1.460952 NaN
4 -1.217231  3.559253  1.627862 NaN
5  1.101384  1.903089  0.822147 NaN
6 -1.510120 -0.878849  0.788121 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

# Subtracting the First Row from the Entire DataFrame

- **`df`**  
  A DataFrame containing numeric values (e.g. from `np.random.randn()`)

- **`df.iloc[0]`**  
  Returns the **first row** as a Series (shape: 1 × n)

- **`df - df.iloc[0]`**  
  Performs **element-wise subtraction** of the **first row** from **each row** in the DataFrame
- ✅ Result  
  First row becomes **all 0s**, and other rows show the **difference** from the first row

In [18]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  1.722538  0.393105  0.274777 -3.043081
2  2.647890  0.440075 -1.081565  0.517709
3  0.966992  1.181645 -2.175084 -3.175184
4  0.584473  1.009325  0.458866 -1.206055
5  2.722879  1.998786  0.165161 -2.202645
6  0.237998 -0.050620  0.136938 -1.569688
7  1.309078  0.985853 -1.674390 -0.518806
8  1.221420 -0.395353 -0.277823 -3.423848
9  1.267944  0.660534 -0.788816 -2.563887

# Applying Arithmetic Operations to the Entire DataFrame

- **`df * 5`**  
  Multiplies **every numeric value** in the DataFrame by **5**

- **`+ 2`**  
  After multiplication, adds **2** to **every value**

-  Final Expression: **`df * 5 + 2`**  
  First multiplies, then adds → i.e. performs the operation:  
  **`(original_value × 5) + 2`**

-  Operation is **element-wise**  
  Applies to **each cell** in the DataFrame individually

In [19]:
 df*5+2

          A          B          C          D
0 -6.885219   0.682472   8.165887  10.257041
1  1.727474   2.647995   9.539771  -4.958362
2  6.354231   2.882848   2.758062  12.845585
3 -2.050257   6.590699  -2.709531  -5.618879
4 -3.962856   5.729096  10.460219   4.226766
5  6.729177  10.676400   8.991693  -0.756184
6 -5.695228   0.429372   8.850580   2.408600
7 -0.339827   5.611737  -0.206061   7.663012
8 -0.778118  -1.294294   6.776775  -6.862200
9 -0.545499   3.985142   4.221805  -2.562395

#  Element-wise Reciprocal of a DataFrame Using `1 / df`

- **`1 / df`** means:  
  Take each number in the DataFrame and **divide 1 by that number**

- This happens **for every cell** in the table — one by one  
  (this is called an **element-wise operation**)

- If any value is **0**, the result will be **infinity (`inf`)**

- If any value is **NaN (missing or empty)**, the result will also be **NaN**

In [20]:
1 / df

           A         B         C          D
0  -0.562732 -3.794986  0.810913   0.605544
1 -18.346844  7.716111  0.663150  -0.718560
2   1.148309  5.663490  6.595770   0.461017
3  -1.234490  1.089159 -1.061677  -0.656264
4  -0.838524  1.340807  0.591001   2.245409
5   1.057266  0.576276  0.715134  -1.814103
6  -0.649753 -3.183441  0.729865  12.236902
7  -2.136910  1.384375 -2.266483   0.882922
8  -1.799779 -1.517776  1.046731  -0.564194
9  -1.964252  2.518712  2.250422  -1.095916

#  Raising All Values in a DataFrame to Power 4 Using `df ** 4`



- This code takes **every number** in the DataFrame `df`  
- And **raises it to the power of 4**  
- In other words: it does **`value × value × value × value`**

- It works on **each cell separately** (element-wise operation)

- This only works if the DataFrame has **numeric values**  
  (it will give error if the column has text)

In [21]:
df **4

          A         B         C          D
0  9.972234  0.004821  2.312610   7.437340
1  0.000009  0.000282  5.170738   3.751010
2  0.575130  0.000972  0.000528  22.137674
3  0.430576  0.710616  0.787101   5.391187
4  2.022726  0.309410  8.196840   0.039339
5  0.800317  9.067306  3.823396   0.092332
6  5.610557  0.009737  3.523946   0.000045
7  0.047957  0.272260  0.037896   1.645546
8  0.095307  0.188438  0.833027   9.869296
9  0.067176  0.024848  0.038989   0.693253

#  Converting 1s and 0s into True/False Using `dtype=bool` in DataFrame

- This code creates a **DataFrame with True/False values**
- We use `dtype=bool` to convert:
  - `1` → `True`  
  - `0` → `False`
  
- It works **column-wise** for all values  
- This is helpful for **logic operations** in pandas

In [22]:
import pandas as pd
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)
df = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)
print(df)

       a      b
0  False   True
1   True   True
2   True  False

#  Applying AND Logical Operator Between Two Boolean DataFrames: `df1 & df2`

- This code uses the **`&` (AND)** operator between two boolean DataFrames: `df1` and `df2`
- It checks **each cell**:
  - If **both values are True**, the result is **True**
  - Otherwise, the result is **False**

- This is called an **element-wise logical operation**
- Both DataFrames must have:
  - The **same shape** (same rows and columns)
  - And **only boolean values**

In [23]:
 df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

# Applying OR Logical Operator Between Two Boolean DataFrames: `df1 | df2`

- This code uses the **`|` (OR)** operator between two boolean DataFrames: `df1` and `df2`
- It checks **each cell**:
  - If **at least one value is True**, the result is **True**
  - If **both are False**, then result is **False**

In [24]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

#  Converting Boolean Values to -1 and 0 Using `-df1`

- This code uses the **unary minus operator (`-`)** on a **boolean DataFrame (`df1`)**
- In pandas, when you apply `-` to a boolean:
  - `True` becomes `-1`
  - `False` becomes `0`

- So this operation **converts True/False into numbers**:
  - `True` → `-1`
  - `False` → `0`

In [25]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

#  Transpose Only the First 5 Rows of a DataFrame Using `df[:5].T`

- `df[:5]` selects the **first 5 rows** from the DataFrame
- `.T` is used to **transpose** the DataFrame:
  - It **flips rows into columns**
  - And **columns into rows**

- So this code shows the **first 5 rows**, but **rotated**
- Transposing is useful for:
  - Better readability
  - Plotting or formatting tables

In [33]:
print(df[:5].T)

          0         1         2         3         4
A -0.359914 -0.096568  0.697960  0.137381 -0.649546
B -0.238951 -0.488984  0.159602 -0.674962 -0.966566
C  0.325460  0.560559 -0.276472 -1.354957 -0.562389
D -0.504582 -0.534400  1.491301 -1.349378  0.390472

#  Creating a Range of Dates Using `pd.date_range()`

- This code creates a sequence of **6 dates**, starting from **January 1, 2013**
- It uses the function `pd.date_range(start_date, periods)`
- The result is a **DatetimeIndex**, which pandas uses to handle dates

In [37]:
dates = pd.date_range('20130101', periods=6)

# Print the result
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Creating a DataFrame with Random Numbers and Date Index


- This code creates a DataFrame with:
  - **6 rows** of **random numbers**
  - **4 columns**: A, B, C, D
  - **Date index** from **2013-01-01 to 2013-01-06**

In [39]:
 df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.604275 -0.020078 -0.290458 -0.188913
2013-01-02 -0.176810  1.077646  0.120606 -0.302282
2013-01-03  1.380452 -1.326638 -2.828209  0.880114
2013-01-04 -0.747176 -0.037740  0.600682 -0.976261
2013-01-05 -0.213447  0.985358 -0.975446 -0.646724
2013-01-06  0.637455  0.165888  1.383143  1.559827

#  Creating a Custom DataFrame `df2` With Mixed Data Types

This code creates a **DataFrame** with **4 rows** and **6 columns**, where each column has a **different data type**.

In [4]:

df2 = pd.DataFrame({
    'A': 1.0,  
    'B': pd.Timestamp('2013-01-02'), 
    'C': pd.Series(1, index=list(range(4)), dtype='float32'), 
    'D': np.array([3] * 4, dtype='int32'),  
    'E': pd.Categorical(["test", "train", "test", "train"]),  
    'F': 'foo'
})
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# Checking Data Types of Each Column Using `df2.dtypes`

This code is used to **see what kind of data** is stored in each column of the DataFra

In [6]:

print(df2.dtypes)

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

#  Displaying the First 5 Rows Using `df.head()`
This code creates a **DataFrame named `df`** which has:

- **6 rows** of random numbers
- **4 columns**: A, B, C, D
- A **date index** starting from **2013-01-01**

This code is used to **view the first 5 records** (rows) from a DataFrame.

In [11]:
import pandas as pd
import numpy as np
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.920671  1.264912  0.030107 -0.664593
2013-01-02  0.249046  1.326292 -0.523090 -1.801563
2013-01-03  0.625397 -0.077841  2.096883  0.733444
2013-01-04  0.478941 -0.802880 -0.542591 -1.624577
2013-01-05  0.194924  1.197848 -1.451985 -0.043211

#  Displaying the Last 3 Rows Using `df.tail(3)`

This code is used to **show the bottom 3 records** (rows) from the DataFrame `df`.

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.478941 -0.802880 -0.542591 -1.624577
2013-01-05  0.194924  1.197848 -1.451985 -0.043211
2013-01-06 -0.765314  1.787213 -0.759633  0.239078

#  Displaying the Index Labels of the DataFrame Using `df.index`

This code is used to **show the index (row labels)** of the DataFrame `df`.

df.index

#  Displaying Column Names of the DataFrame Using `df.columns`

This code is used to **see the names of all columns** in the DataFrame `df`.

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

#  Displaying Only the Data Values Using `df.values`

This code is used to **see only the raw data** (values) from the DataFrame —  
**without column names or row labels**.

In [19]:
df.values

array([[-0.92067103,  1.26491216,  0.03010723, -0.66459319],
       [ 0.24904553,  1.32629235, -0.52308995, -1.80156262],
       [ 0.62539681, -0.07784119,  2.09688347,  0.73344392],
       [ 0.47894108, -0.80287997, -0.54259077, -1.62457663],
       [ 0.19492448,  1.19784807, -1.45198484, -0.04321083],
       [-0.76531388,  1.78721323, -0.75963308,  0.23907779]])

# Transposing Your DataFrame Using `df.T`

This code is used to **transpose the DataFrame**, which means it:

- **Flips the rows and columns**
- **Rows become columns**, and **columns become rows**

In [21]:
 
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.920671    0.249046    0.625397    0.478941    0.194924   -0.765314
B    1.264912    1.326292   -0.077841   -0.802880    1.197848    1.787213
C    0.030107   -0.523090    2.096883   -0.542591   -1.451985   -0.759633
D   -0.664593   -1.801563    0.733444   -1.624577   -0.043211    0.239078

# Sorting Columns by Axis Using`

This code is used to **sort the DataFrame's columns** (not rows).

In [22]:

 df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.664593  0.030107  1.264912 -0.920671
2013-01-02 -1.801563 -0.523090  1.326292  0.249046
2013-01-03  0.733444  2.096883 -0.077841  0.625397
2013-01-04 -1.624577 -0.542591 -0.802880  0.478941
2013-01-05 -0.043211 -1.451985  1.197848  0.194924
2013-01-06  0.239078 -0.759633  1.787213 -0.765314

## Sorting Rows by Column 

This code is used to **sort the rows of the DataFrame** based on the values in **column 'B'**.

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.478941 -0.802880 -0.542591 -1.624577
2013-01-03  0.625397 -0.077841  2.096883  0.733444
2013-01-05  0.194924  1.197848 -1.451985 -0.043211
2013-01-01 -0.920671  1.264912  0.030107 -0.664593
2013-01-02  0.249046  1.326292 -0.523090 -1.801563
2013-01-06 -0.765314  1.787213 -0.759633  0.239078

# Quick Statistical Summary 

This code is used to get a **quick summary of statistics** for your numerical data.

In [26]:

 df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.022946  0.782591 -0.191718 -0.526904
std    0.655852  0.996395  1.219067  1.025452
min   -0.920671 -0.802880 -1.451985 -1.801563
25%   -0.525254  0.241081 -0.705373 -1.384581
50%    0.221985  1.231380 -0.532840 -0.353902
75%    0.421467  1.310947 -0.108192  0.168506
max    0.625397  1.787213  2.096883  0.733444

# Selecting a Single Column from a DataFrame

This code is used to **select only one column** from the DataFrame — and it gives the result as a **Series**.

In [28]:
df['A']

2013-01-01   -0.920671
2013-01-02    0.249046
2013-01-03    0.625397
2013-01-04    0.478941
2013-01-05    0.194924
2013-01-06   -0.765314
Freq: D, Name: A, dtype: float64

# Selecting Rows by Slicing 

This code is used to **select a range of rows** from the DataFrame — based on their **position (index number)**.

In [30]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.920671  1.264912  0.030107 -0.664593
2013-01-02  0.249046  1.326292 -0.523090 -1.801563
2013-01-03  0.625397 -0.077841  2.096883  0.733444

#  Selecting Rows by Date Range

This code is used to **select rows by date labels**, not by position.

In [31]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.249046  1.326292 -0.523090 -1.801563
2013-01-03  0.625397 -0.077841  2.096883  0.733444
2013-01-04  0.478941 -0.802880 -0.542591 -1.624577

 ## Selecting on Multiple Axes by Label

This code is used to **select specific columns** using their **labels**, across **all rows**.

In [34]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.920671  1.264912
2013-01-02  0.249046  1.326292
2013-01-03  0.625397 -0.077841
2013-01-04  0.478941 -0.802880
2013-01-05  0.194924  1.197848
2013-01-06 -0.765314  1.787213

# Label Slicing with Included Endpoints 

This code is used to **select a specific range of rows and specific columns** using **labels (not positions)**.

In [37]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.249046  1.326292
2013-01-03  0.625397 -0.077841
2013-01-04  0.478941 -0.802880

# Reduction in Dimensions

This code selects a **single row** and **some specific columns** — and returns a **Series** instead of a DataFrame.

In [39]:
df.loc['20130102',['A','B']]

A    0.249046
B    1.326292
Name: 2013-01-02 00:00:00, dtype: float64

# Accessing a Scalar Value

This code is used to **get a single value (scalar)** from the DataFrame — from a specific **row and column**.

In [43]:
df.loc[dates[0],'A']

np.float64(-0.9206710257816915)

#  Fast Access to a Scalar Value 

This code is used to get a **single cell value** from the DataFrame, and it works **faster than `loc[]`** when you're only accessing **one scalar**.

In [42]:
df.at[dates[0],'A']

np.float64(-0.9206710257816915)

#  Selecting a Single Row by Position 

This code is used to **select one row** from a DataFrame using its **integer position** (not label name).

In [6]:
df.iloc[3]

A    0.388668
B   -1.613518
C   -1.713179
D    0.035402
Name: 2013-01-04 00:00:00, dtype: float64

#  Selecting Rows and Columns by Integer Slices 

This code selects a **specific set of rows and columns** using **integer-based slicing**, just like in Python lists or NumPy arrays.

In [8]:

df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.388668 -1.613518
2013-01-05  1.988020 -0.068843

#  Selecting Specific Rows and Columns 

This line selects **specific rows and columns** from the DataFrame by using **lists of integer positions** — just like in NumPy.

In [13]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.793731  1.116814
2013-01-03  2.527459 -0.043718
2013-01-05  1.988020  0.948234

 ## Selecting a Range of Columns 

This code is used to **select specific columns** from the DataFrame using **position-based slicing**, and it includes **all rows**.

In [16]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.220438 -1.533635
2013-01-02 -0.469725  1.116814
2013-01-03 -1.344347 -0.043718
2013-01-04 -1.613518 -1.713179
2013-01-05 -0.068843  0.948234
2013-01-06 -0.356748 -0.178683

# Getting a Specific Cell Value 
This code is used to get **one specific value** from the DataFrame using **row and column positions**.

In [18]:
df.iloc[1,1]

np.float64(-0.469725)

# Filtering Rows Based on Column Values

This code is used to **filter rows** from the DataFrame where the value in column **'A'** is **greater than 0**.

In [20]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.793731 -0.469725  1.116814 -0.235097
2013-01-03  2.527459 -1.344347 -0.043718  0.136468
2013-01-04  0.388668 -1.613518 -1.713179  0.035402
2013-01-05  1.988020 -0.068843  0.948234  0.136082
2013-01-06  1.724599 -0.356748 -0.178683  0.779853

#  Selecting Only Positive Values in the DataFrame 

This code filters the **entire DataFrame**, and only keeps the **values greater than 0**.  
All other values (which don't meet the condition) are replaced with **NaN**.

In [23]:
df[df > 0]

                   A   B         C         D
2013-01-01       NaN NaN       NaN       NaN
2013-01-02  0.793731 NaN  1.116814       NaN
2013-01-03  2.527459 NaN       NaN  0.136468
2013-01-04  0.388668 NaN       NaN  0.035402
2013-01-05  1.988020 NaN  0.948234  0.136082
2013-01-06  1.724599 NaN       NaN  0.779853

# Creating a Copy of a DataFrame and Adding a New Column for Filtering with `isin()`

This code makes a **copy** of the original DataFrame, adds a new column `'E'`, and prepares it for **filtering using the `isin()` method**.

In [25]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.119099 -1.220438 -1.533635 -1.024571    one
2013-01-02  0.793731 -0.469725  1.116814 -0.235097    one
2013-01-03  2.527459 -1.344347 -0.043718  0.136468    two
2013-01-04  0.388668 -1.613518 -1.713179  0.035402  three
2013-01-05  1.988020 -0.068843  0.948234  0.136082   four
2013-01-06  1.724599 -0.356748 -0.178683  0.779853  three

#  Filtering Rows Where Column `'E'` Matches Specific Values

This code is used to **filter** rows based on specific **category values** in a column.  
It shows only those rows where the **value in column `'E'` is either `'two'` or `'four'`**.

In [26]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  2.527459 -1.344347 -0.043718  0.136468   two
2013-01-05  1.988020 -0.068843  0.948234  0.136082  four